jmdapozzo/esp-hub75/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.1 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_HUB75_BOARD_CUSTOM=y
CONFIG_HUB75_PANEL_HEIGHT=32
CONFIG_HUB75_SCAN_1_32=y
CONFIG_HUB75_LAYOUT_COLS=2
CONFIG_HUB75_PIN_B2=6
CONFIG_HUB75_PIN_B=16
CONFIG_HUB75_PIN_D=15
